yueming95/micinveter/Document/ReferenceMaterial/基于 GaN 的 1.6kW 双向微型逆变器参考设计/Example Projects/F28P55x/uinv.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F28P55x" --package "128PDT" --part "F28P55x_128PDT" --context "system" --product "C2000WARE@5.02.00.00"
 * @versions {"tool":"1.20.0+3587"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc              = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1             = adc.addInstance();
const adc2             = adc.addInstance();
const adc3             = adc.addInstance();
const adc4             = adc.addInstance();
const adc5             = adc.addInstance();
const analog           = scripting.addModule("/driverlib/analog.js", {}, false);
const analog1          = analog.addInstance();
const asysctl          = scripting.addModule("/driverlib/asysctl.js");
const clb              = scripting.addModule("/driverlib/clb.js", {}, false);
const clb1             = clb.addInstance();
const cmpss            = scripting.addModule("/driverlib/cmpss.js", {}, false);
const cmpss1           = cmpss.addInstance();
const cmpss2           = cmpss.addInstance();
const device_support   = scripting.addModule("/driverlib/device_support.js");
const ecap             = scripting.addModule("/driverlib/ecap.js", {}, false);
const ecap1            = ecap.addInstance();
const epwm             = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1            = epwm.addInstance();
const epwm2            = epwm.addInstance();
const epwm3            = epwm.addInstance();
const epwm4            = epwm.addInstance();
const epwm5            = epwm.addInstance();
const epwm6            = epwm.addInstance();
const epwm7            = epwm.addInstance();
const epwm8            = epwm.addInstance();
const epwmxbar         = scripting.addModule("/driverlib/epwmxbar.js", {}, false);
const epwmxbar1        = epwmxbar.addInstance();
const epwmxbar2        = epwmxbar.addInstance();
const epwmxbar3        = epwmxbar.addInstance();
const gpio             = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1            = gpio.addInstance();
const gpio2            = gpio.addInstance();
const gpio3            = gpio.addInstance();
const gpio4            = gpio.addInstance();
const gpio5            = gpio.addInstance();
const gpio6            = gpio.addInstance();
const gpio7            = gpio.addInstance();
const gpio8            = gpio.addInstance();
const gpio9            = gpio.addInstance();
const gpio10           = gpio.addInstance();
const inputxbar_input  = scripting.addModule("/driverlib/inputxbar_input.js", {}, false);
const inputxbar_input1 = inputxbar_input.addInstance();
const inputxbar_input2 = inputxbar_input.addInstance();
const inputxbar_input3 = inputxbar_input.addInstance();
const inputxbar_input4 = inputxbar_input.addInstance();
const sci              = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1             = sci.addInstance();
const sync             = scripting.addModule("/driverlib/sync.js");
const sysctl           = scripting.addModule("/driverlib/sysctl.js");

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name                       = "ADC_A";
adc1.soc0IndependentNameMode     = true;
adc1.soc0InputCapacitance        = 300;
adc1.soc0InputResistance         = 300;
adc1.soc0UseCalculatedSampleTime = true;
adc1.soc1InputCapacitance        = 300;
adc1.soc1InputResistance         = 300;
adc1.soc1UseCalculatedSampleTime = true;
adc1.soc1IndependentNameMode     = true;
adc1.soc2IndependentNameMode     = true;
adc1.soc3IndependentNameMode     = true;
adc1.soc2InputCapacitance        = 300;
adc1.soc2InputResistance         = 300;
adc1.soc3InputCapacitance        = 300;
adc1.soc3InputResistance         = 300;
adc1.soc3UseCalculatedSampleTime = true;
adc1.soc2UseCalculatedSampleTime = true;
adc1.interruptPulseMode          = "ADC_PULSE_END_OF_CONV";
adc1.soc4IndependentNameMode     = true;
adc1.soc0Name                    = "SOC_BOOST1_CS1";
adc1.soc0Trigger                 = "ADC_TRIGGER_EPWM4_SOCA";
adc1.soc1Name                    = "SOC_BOOST1_CS2";
adc1.soc1Trigger                 = "ADC_TRIGGER_EPWM4_SOCB";
adc1.soc2Name                    = "SOC_BOOST1_VS";
adc1.soc2Trigger                 = "ADC_TRIGGER_EPWM4_SOCB";
adc1.soc4Trigger                 = "ADC_TRIGGER_EPWM2_SOCB";
adc1.soc4UseCalculatedSampleTime = true;
adc1.soc4InputResistance         = 100;
adc1.soc4InputCapacitance        = 100;
adc1.soc4SampleWindow            = 12;
adc1.soc3SampleWindow            = 12;
adc1.soc2SampleWindow            = 12;
adc1.soc1SampleWindow            = 12;
adc1.soc0SampleWindow            = 12;
adc1.soc5Name                    = "SOC_BOOST2_VS";
adc1.soc5SampleWindow            = 12;
adc1.soc5Channel                 = "ADC_CH_ADCIN2";
adc1.soc5Trigger                 = "ADC_TRIGGER_EPWM2_SOCB";
adc1.soc5IndependentNameMode     = true;
adc1.adcClockPrescaler           = "ADC_CLK_DIV_2_0";
adc1.soc0Channel                 = "ADC_CH_ADCIN14";
adc1.soc1Channel                 = "ADC_CH_ADCIN14";
adc1.soc2Channel                 = "ADC_CH_ADCIN3";
adc1.soc3Channel                 = "ADC_CH_ADCIN9";
adc1.soc3Name                    = "SOC_DC_BUS_VS ";
adc1.soc4Name                    = "SOC_AC_VS";
adc1.soc4Channel                 = "ADC_CH_ADCIN27";
adc1.soc6Name                    = "SOC_AC_CS1";
adc1.soc6Channel                 = "ADC_CH_ADCIN26";
adc1.soc7Name                    = "SOC_AC_CS2";
adc1.soc7Channel                 = "ADC_CH_ADCIN26";
adc1.soc6IndependentNameMode     = true;
adc1.soc6Trigger                 = "ADC_TRIGGER_EPWM8_SOCA";
adc1.soc6SampleWindow            = 12;
adc1.soc7Trigger                 = "ADC_TRIGGER_EPWM8_SOCB";
adc1.soc7SampleWindow            = 12;
adc1.soc3Trigger                 = "ADC_TRIGGER_EPWM8_SOCB";
adc1.enabledSOCs                 = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3"];
adc1.enabledInts                 = ["ADC_INT_NUMBER1"];
adc1.enableInterrupt1            = true;
adc1.interrupt1SOCSource         = "ADC_INT_TRIGGER_EOC3";
adc1.registerInterrupts          = ["1"];
adc1.adcInt1.interruptHandler    = "ISR1";
adc1.adcInt1.enableInterrupt     = true;

