yueming95/micinveter/Document/ReferenceMaterial/基于 GaN 的 1.6kW 双向微型逆变器参考设计/Example Projects/F28P55x/uinv.syscfg
adc2.$name                       = "ADC_B";
adc2.adcBase                     = "ADCB_BASE";
adc2.soc0IndependentNameMode     = true;
adc2.soc1IndependentNameMode     = true;
adc2.soc0InputCapacitance        = 300;
adc2.soc0InputResistance         = 300;
adc2.soc0UseCalculatedSampleTime = true;
adc2.soc1InputCapacitance        = 300;
adc2.soc1InputResistance         = 300;
adc2.soc1UseCalculatedSampleTime = true;
adc2.soc2IndependentNameMode     = true;
adc2.soc3IndependentNameMode     = true;
adc2.soc2InputCapacitance        = 300;
adc2.soc2InputResistance         = 300;
adc2.soc2UseCalculatedSampleTime = true;
adc2.soc3InputCapacitance        = 300;
adc2.soc3InputResistance         = 300;
adc2.soc3UseCalculatedSampleTime = true;
adc2.soc4IndependentNameMode     = true;
adc2.soc4InputResistance         = 300;
adc2.soc4UseCalculatedSampleTime = true;
adc2.soc4InputCapacitance        = 300;
adc2.soc5IndependentNameMode     = true;
adc2.soc5InputCapacitance        = 100000;
adc2.soc5InputResistance         = 300;
adc2.soc5UseCalculatedSampleTime = true;
adc2.interruptPulseMode          = "ADC_PULSE_END_OF_CONV";
adc2.soc0SampleWindow            = 12;
adc2.soc1SampleWindow            = 12;
adc2.soc2SampleWindow            = 12;
adc2.soc3Trigger                 = "ADC_TRIGGER_EPWM3_SOCA";
adc2.soc3SampleWindow            = 12;
adc2.soc4Trigger                 = "ADC_TRIGGER_EPWM3_SOCB";
adc2.soc4SampleWindow            = 12;
adc2.soc5Trigger                 = "ADC_TRIGGER_EPWM3_SOCB";
adc2.soc5SampleWindow            = 12;
adc2.soc6Trigger                 = "ADC_TRIGGER_EPWM3_SOCB";
adc2.soc6SampleWindow            = 12;
adc2.soc7Trigger                 = "ADC_TRIGGER_EPWM3_SOCA";
adc2.soc7SampleWindow            = 12;
adc2.soc7IndependentNameMode     = true;
adc2.soc6IndependentNameMode     = true;
adc2.enabledInts                 = ["ADC_INT_NUMBER1"];
adc2.enableInterrupt1            = true;
adc2.registerInterrupts          = ["1"];
adc2.adcClockPrescaler           = "ADC_CLK_DIV_2_0";
adc2.soc6Channel                 = "ADC_CH_ADCIN8";
adc2.soc7Channel                 = "ADC_CH_ADCIN4";
adc2.soc6Name                    = "";
adc2.soc4Name                    = "SOC_LLC_VS";
adc2.soc4Channel                 = "ADC_CH_ADCIN8";
adc2.soc7Name                    = "";
adc2.soc5Name                    = "SOC_IREF";
adc2.soc5Channel                 = "ADC_CH_ADCIN4";
adc2.soc0Name                    = "SOC_AC_CS1";
adc2.soc0Trigger                 = "ADC_TRIGGER_EPWM8_SOCA";
adc2.soc1Name                    = "SOC_AC_CS2";
adc2.soc1Trigger                 = "ADC_TRIGGER_EPWM8_SOCB";
adc2.soc2Channel                 = "ADC_CH_ADCIN8";
adc2.soc2Name                    = "SOC_LLC_VS";
adc2.interrupt1SOCSource         = "ADC_INT_TRIGGER_EOC2";
adc2.enabledSOCs                 = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3"];
adc2.soc3Name                    = "SOC_IREF";
adc2.soc3Channel                 = "ADC_CH_ADCIN4";
adc2.soc2Trigger                 = "ADC_TRIGGER_EPWM3_SOCB";
adc2.soc0Channel                 = "ADC_CH_ADCIN10";
adc2.soc1Channel                 = "ADC_CH_ADCIN10";
adc2.adcInt1.enableInterrupt     = true;
adc2.adcInt1.interruptHandler    = "ISR2";

adc3.$name                       = "ADC_C";
adc3.adcBase                     = "ADCC_BASE";
adc3.soc0IndependentNameMode     = true;
adc3.soc0InputCapacitance        = 300;
adc3.soc0InputResistance         = 300;
adc3.soc0UseCalculatedSampleTime = true;
adc3.soc1IndependentNameMode     = true;
adc3.soc1InputCapacitance        = 300;
adc3.soc1InputResistance         = 300;
adc3.soc1UseCalculatedSampleTime = true;
adc3.soc2IndependentNameMode     = true;
adc3.soc2InputCapacitance        = 300;
adc3.soc2InputResistance         = 300;
adc3.soc2UseCalculatedSampleTime = true;
adc3.soc3IndependentNameMode     = true;
adc3.soc3InputCapacitance        = 300;
adc3.soc3InputResistance         = 300;
adc3.soc3UseCalculatedSampleTime = true;
adc3.soc4IndependentNameMode     = true;
adc3.soc4InputResistance         = 10000;
adc3.soc4InputCapacitance        = 100000;
adc3.soc5IndependentNameMode     = true;
adc3.soc0SampleWindow            = 12;
adc3.soc1SampleWindow            = 12;
adc3.soc2SampleWindow            = 12;
adc3.soc3SampleWindow            = 12;
adc3.soc4SampleWindow            = 12;
adc3.soc6Name                    = "SOC_TEMP";
adc3.soc6IndependentNameMode     = true;
adc3.soc6SampleWindow            = 12;
adc3.enableInterrupt2            = true;
adc3.registerInterrupts          = ["1"];
adc3.adcClockPrescaler           = "ADC_CLK_DIV_2_0";
adc3.soc6Channel                 = "ADC_CH_ADCIN6";
adc3.soc4Channel                 = "ADC_CH_ADCIN1";
adc3.interrupt1SOCSource         = "ADC_INT_TRIGGER_EOC5";
adc3.enabledSOCs                 = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc3.soc0Name                    = "SOC_BOOST2_CS1";
adc3.soc0Channel                 = "ADC_CH_ADCIN25";
adc3.soc0Trigger                 = "ADC_TRIGGER_EPWM2_SOCA";
adc3.soc1Name                    = "SOC_BOOST2_CS2";
adc3.soc1Channel                 = "ADC_CH_ADCIN25";
adc3.soc2Name                    = "SOC_BOOST2_VS ";
adc3.soc2Channel                 = "ADC_CH_ADCIN9";
adc3.soc2Trigger                 = "ADC_TRIGGER_EPWM2_SOCB";
adc3.soc3Name                    = "SOC_BOOST4_CS1 ";
adc3.soc3Channel                 = "ADC_CH_ADCIN1";
adc3.soc3Trigger                 = "ADC_TRIGGER_EPWM3_SOCA";
adc3.soc4Name                    = "SOC_BOOST4_CS2 ";
adc3.soc4Trigger                 = "ADC_TRIGGER_EPWM3_SOCB";
adc3.soc5Channel                 = "ADC_CH_ADCIN10";
adc3.soc5Trigger                 = "ADC_TRIGGER_EPWM3_SOCB";
adc3.interruptPulseMode          = "ADC_PULSE_END_OF_CONV";
adc3.interrupt2SOCSource         = "ADC_INT_TRIGGER_EOC4";
adc3.soc1Trigger                 = "ADC_TRIGGER_EPWM2_SOCB";
adc3.soc5SampleWindow            = 12;
adc3.soc5Name                    = "SOC_BOOST4_VS";
adc3.useInterrupts               = false;

adc4.$name                   = "ADC_D";
adc4.adcBase                 = "ADCD_BASE";
adc4.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc4.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2"];
adc4.soc0Name                = "SOC_BOOST3_CS1";
adc4.soc0Channel             = "ADC_CH_ADCIN7";
adc4.soc0SampleWindow        = 12;
adc4.soc1Name                = "SOC_BOOST3_CS2";
adc4.soc1Channel             = "ADC_CH_ADCIN7";
adc4.soc1SampleWindow        = 12;
adc4.soc2Name                = "SOC_BOOST3_VS";
adc4.soc2Channel             = "ADC_CH_ADCIN10";
adc4.soc2SampleWindow        = 12;
adc4.soc0Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc2Trigger             = "ADC_TRIGGER_EPWM1_SOCB";
adc4.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc4.soc1IndependentNameMode = true;
adc4.soc2IndependentNameMode = true;
adc4.soc0IndependentNameMode = true;

adc5.$name                   = "ADC_E";
adc5.adcBase                 = "ADCE_BASE";
adc5.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc5.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3"];
adc5.soc3Name                = "SOC_TEMP";
adc5.soc3SampleWindow        = 12;
adc5.soc3Channel             = "ADC_CH_ADCIN12";
adc5.soc0Name                = "SOC_DC_BUS_CS1";
adc5.soc0Channel             = "ADC_CH_ADCIN6";
adc5.soc0SampleWindow        = 12;
adc5.soc1Name                = "SOC_DC_BUS_CS2";
adc5.soc1Channel             = "ADC_CH_ADCIN6";
adc5.soc0Trigger             = "ADC_TRIGGER_EPWM8_SOCA";
adc5.soc1Trigger             = "ADC_TRIGGER_EPWM8_SOCB";
adc5.soc1SampleWindow        = 12;
adc5.soc2Name                = "SOC_AC_VS";
adc5.soc2Channel             = "ADC_CH_ADCIN9";
adc5.soc2SampleWindow        = 12;
adc5.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc5.soc3IndependentNameMode = true;
adc5.soc0IndependentNameMode = true;
adc5.soc1IndependentNameMode = true;
adc5.soc2IndependentNameMode = true;
adc5.soc2Trigger             = "ADC_TRIGGER_EPWM8_SOCA";

