yueming95/micinveter/Document/ReferenceMaterial/基于 GaN 的 1.6kW 双向微型逆变器参考设计/Example Projects/F28P55x/uinv.syscfg
epwm8.$name                                                      = "DCAC";
epwm8.copyUse                                                    = true;
epwm8.copyFrom                                                   = "LLC2";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm8.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm8.epwmDeadband_enableRED                                     = true;
epwm8.epwmDeadband_enableFED                                     = true;
epwm8.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm8.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm8.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm8.epwmDeadband_delayRED                                      = 10;
epwm8.epwmDeadband_delayFED                                      = 10;
epwm8.epwmEventTrigger_EPWM_SOC_B_triggerEnable                  = true;
epwm8.epwmEventTrigger_EPWM_SOC_B_triggerSource                  = "EPWM_SOC_TBCTR_PERIOD";
epwm8.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm8.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_ZERO";
epwm8.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "6";
epwm8.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar          = "6";
epwm8.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                  = "EPWM_TZ_ACTION_LOW";
epwm8.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                  = "EPWM_TZ_ACTION_LOW";
epwm8.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                      = "EPWM_TZ_ACTION_LOW";
epwm8.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                      = "EPWM_TZ_ACTION_LOW";
epwm8.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT2                  = "EPWM_TZ_ACTION_LOW";
epwm8.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT2                  = "EPWM_TZ_ACTION_LOW";
epwm8.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM4";
epwm8.epwmTimebase_period                                        = 626;
epwm8.epwm.$assign                                               = "EPWM8";
epwm8.epwm.epwm_aPin.$assign                                     = "GPIO14";
epwm8.epwm.epwm_bPin.$assign                                     = "GPIO15";

epwmxbar1.$name      = "myEPWMXBAR0";
epwmxbar1.tripInput  = "XBAR_TRIP5";
epwmxbar1.mux6Config = "XBAR_EPWM_MUX06_CMPSS4_CTRIPH_OR_L";
epwmxbar1.muxesUsed  = ["XBAR_MUX00"];
epwmxbar1.mux0Config = "XBAR_EPWM_MUX00_CMPSS1_CTRIPH_OR_L";

epwmxbar2.$name           = "myEPWMXBAR1_SRTRIP_P";
epwmxbar2.tripInput       = "XBAR_TRIP11";
epwmxbar2.useSourceSelect = true;
epwmxbar2.sourceSignals   = ["CMPSS4_CTRIPL"];

epwmxbar3.$name           = "myEPWMXBAR1_SRTRIP_N";
epwmxbar3.tripInput       = "XBAR_TRIP12";
epwmxbar3.mux5Config      = "XBAR_EPWM_MUX05_ADCCEVT3";
epwmxbar3.sourceSignals   = ["CMPSS4_CTRIPH"];
epwmxbar3.useSourceSelect = true;

gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.writeInitialValue = true;
gpio1.$name             = "ISO_PWR_EN";
gpio1.gpioPin.$assign   = "GPIO43";

gpio2.$name             = "LED1";
gpio2.direction         = "GPIO_DIR_MODE_OUT";
gpio2.writeInitialValue = true;
gpio2.gpioPin.$assign   = "GPIO19, X1";

gpio3.direction         = "GPIO_DIR_MODE_OUT";
gpio3.writeInitialValue = true;
gpio3.$name             = "uINV_DCAC_Relay";
gpio3.gpioPin.$assign   = "GPIO46";

gpio4.direction       = "GPIO_DIR_MODE_OUT";
gpio4.$name           = "uINV_DCAC_Top_LF";
gpio4.gpioPin.$assign = "GPIO56";

gpio5.direction       = "GPIO_DIR_MODE_OUT";
gpio5.$name           = "uINV_DCAC_Bottom_LF";
gpio5.gpioPin.$assign = "GPIO57";

gpio6.$name             = "ENABLE";
gpio6.direction         = "GPIO_DIR_MODE_OUT";
gpio6.writeInitialValue = true;
gpio6.initialValue      = 1;
gpio6.gpioPin.$assign   = "GPIO34";

gpio7.direction         = "GPIO_DIR_MODE_OUT";
gpio7.writeInitialValue = true;
gpio7.$name             = "uINV_DCAC_TestPoint_1";
gpio7.gpioPin.$assign   = "A25, D3, E3, GPIO17";

gpio8.direction         = "GPIO_DIR_MODE_OUT";
gpio8.writeInitialValue = true;
gpio8.$name             = "uINV_DCAC_TestPoint_2";
gpio8.gpioPin.$assign   = "C24, D2, E2, GPIO16";

gpio9.writeInitialValue = true;
gpio9.$name             = "Shutdown_Demo";
gpio9.gpioPin.$assign   = "GPIO31";

gpio10.writeInitialValue = true;
gpio10.$name             = "RapidShutdown";
gpio10.gpioPin.$assign   = "GPIO30";

inputxbar_input1.$name         = "myINPUTXBARINPUT0";
inputxbar_input1.inputxbarGpio = "GPIO61";

inputxbar_input2.$name          = "myINPUTXBARINPUT1";
inputxbar_input2.inputxbarInput = "XBAR_INPUT2";
inputxbar_input2.inputxbarGpio  = "GPIO58";

inputxbar_input3.$name          = "myINPUTXBARINPUT2";
inputxbar_input3.inputxbarInput = "XBAR_INPUT3";
inputxbar_input3.inputxbarGpio  = "GPIO48";

inputxbar_input4.$name          = "myINPUTXBARINPUT3";
inputxbar_input4.inputxbarInput = "XBAR_INPUT4";
inputxbar_input4.inputxbarGpio  = "GPIO49";

sci1.$name                 = "SCI_COMMS";
sci1.useInterrupts         = false;
sci1.sci.$assign           = "SCIA";
sci1.sci.sci_rxPin.$assign = "A16, B16, C16, GPIO28";
sci1.sci.sci_txPin.$assign = "GPIO29";

sync.ADCSOCAOutputSelect = ["SYSCTL_ADCSOC_SRC_PWM1SOCA","SYSCTL_ADCSOC_SRC_PWM2SOCA","SYSCTL_ADCSOC_SRC_PWM3SOCA","SYSCTL_ADCSOC_SRC_PWM4SOCA","SYSCTL_ADCSOC_SRC_PWM8SOCA"];
sync.ADCSOCBOutputSelect = ["SYSCTL_ADCSOC_SRC_PWM1SOCB","SYSCTL_ADCSOC_SRC_PWM2SOCB","SYSCTL_ADCSOC_SRC_PWM3SOCB","SYSCTL_ADCSOC_SRC_PWM4SOCB","SYSCTL_ADCSOC_SRC_PWM8SOCB"];

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
analog1.analog.$suggestSolution                                     = "ANALOG";
analog1.analog["a0, b15, c15, daca_outPin"].$suggestSolution        = "A0, B15, C15, DACA_OUT";
analog1.analog["a4, b8, c14Pin"].$suggestSolution                   = "A4, B8, C14";
analog1.analog["a8, b0, c11Pin"].$suggestSolution                   = "A8, B0, C11";
analog1.analog["a9, gpio227Pin"].$suggestSolution                   = "A9, GPIO227";
analog1.analog["a10, b1, c10, gpio230Pin"].$suggestSolution         = "A10, B1, C10, GPIO230";
analog1.analog["a2, b6, c9, pga1_inp, gpio224Pin"].$suggestSolution = "A2, B6, C9, PGA1_INP, GPIO224";
analog1.analog["a6, d14, e14, gpio228Pin"].$suggestSolution         = "A6, D14, E14, GPIO228";
analog1.analog["b2, c6, e12, gpio226Pin"].$suggestSolution          = "B2, C6, E12, GPIO226";
analog1.analog["a1, b7, d11, dacb_outPin"].$suggestSolution         = "A1, B7, D11, DACB_OUT";
analog1.analog["a26, d6, e6Pin"].$suggestSolution                   = "A26, D6, E6";
analog1.analog["b26, d7, e7Pin"].$suggestSolution                   = "B26, D7, E7";
analog1.analog["c25, d5, e5Pin"].$suggestSolution                   = "C25, D5, E5";
analog1.analog["b4, c8, gpio236Pin"].$suggestSolution               = "B4, C8, GPIO236";
analog1.analog["a12, c1, e11, pga3_inpPin"].$suggestSolution        = "A12, C1, E11, PGA3_INP";
analog1.analog["a3, b3, pga2_inp, c5, gpio242Pin"].$suggestSolution = "A3, B3, PGA2_INP, C5, GPIO242";
analog1.analog["a11, b10, c0, pga2_outPin"].$suggestSolution        = "A11, B10, C0, PGA2_OUT";
analog1.analog["a14, b14, c4, pga1_outPin"].$suggestSolution        = "A14, B14, C4, PGA1_OUT";
analog1.analog["a27, d9, e9, gpio212Pin"].$suggestSolution          = "A27, D9, E9, GPIO212";
analog1.analog["b27, d10, e10, gpio213Pin"].$suggestSolution        = "B27, D10, E10, GPIO213";
analog1.analog["c26, d8, e8, gpio211Pin"].$suggestSolution          = "C26, D8, E8, GPIO211";
analog1.analog["a7, b30, c3, d12, e30Pin"].$suggestSolution         = "A7, B30, C3, D12, E30";
analog1.analog["b5, d15, e15, pga3_outPin"].$suggestSolution        = "B5, D15, E15, PGA3_OUT";
